[
  {
    "id": 1,
    "clue": "The Social Giant",
    "riddle": "I was born in a dorm room in 2004. I connect billions of people but I'm not a phone company. Mark is my creator. What am I?",
    "answer": "Facebook / Meta"
  },
  {
    "id": 2,
    "clue": "The Search Master",
    "riddle": "I'm a verb and a noun. People use me billions of times a day to find answers. My name was inspired by a very large number. What am I?",
    "answer": "Google"
  },
  {
    "id": 3,
    "clue": "The Fruit Company",
    "riddle": "I'm a fruit, but you can't eat me. I make phones, computers, and watches. My logo had a bite taken out of it. What company am I?",
    "answer": "Apple"
  },
  {
    "id": 4,
    "clue": "The Cloud Storage",
    "riddle": "I live in the cloud and keep your files safe. My name is a container where you store things. Google made me. What am I?",
    "answer": "Google Drive"
  },
  {
    "id": 5,
    "clue": "The Video Kingdom",
    "riddle": "I was bought by Google in 2006. Every minute, 500 hours of content are uploaded to me. You can watch anything from cats to courses. What am I?",
    "answer": "YouTube"
  },
  {
    "id": 6,
    "clue": "The Email Classic",
    "riddle": "I have an inbox but I'm not a mailbox. I have spam but I'm not a grocery store. I have drafts but I'm not a writer's desk. What am I?",
    "answer": "Email"
  },
  {
    "id": 7,
    "clue": "The Meeting Helper",
    "riddle": "I help teams talk face-to-face without being in the same place. I have a mute button that saves embarrassing moments. You're probably using me right now! What am I?",
    "answer": "Video call / Zoom / Google Meet"
  },
  {
    "id": 8,
    "clue": "The Shopping Giant",
    "riddle": "I started by selling books, now I sell everything. My name is also a famous rainforest. Prime is my special membership. What company am I?",
    "answer": "Amazon"
  },
  {
    "id": 9,
    "clue": "The Password Problem",
    "riddle": "I'm a combination of letters, numbers, and symbols. I protect your accounts but you always forget me. You probably have too many of me. What am I?",
    "answer": "Password"
  },
  {
    "id": 10,
    "clue": "The Notification Buzz",
    "riddle": "I pop up on your screen to tell you something new. I can be helpful or annoying. You can turn me off in settings. What am I?",
    "answer": "Notification / Alert"
  },
  {
    "id": 11,
    "clue": "The Wireless Wonder",
    "riddle": "I connect your devices without any wires. I'm in coffee shops, homes, and airports. You always ask for my password when you visit someone. What am I?",
    "answer": "WiFi"
  },
  {
    "id": 12,
    "clue": "The Professional Network",
    "riddle": "I'm a social network for your career, not your personal life. I have a blue logo and help people find jobs. Recruiters love me. What am I?",
    "answer": "LinkedIn"
  },
  {
    "id": 13,
    "clue": "The Double Click",
    "riddle": "I live under your hand and help you navigate your screen. I have left and right buttons, and sometimes a wheel in the middle. What am I?",
    "answer": "Mouse"
  },
  {
    "id": 14,
    "clue": "The Emoji Story",
    "riddle": "I'm a small digital image or icon used to express an idea or emotion. I can be happy, sad, or even a pizza. What am I?",
    "answer": "Emoji"
  },
  {
    "id": 15,
    "clue": "The Streaming Service",
    "riddle": "I started by mailing DVDs, now I stream shows and movies. 'N' is my first letter. Binge-watching was practically invented because of me. What am I?",
    "answer": "Netflix"
  },
  {
    "id": 16,
    "clue": "The Dark Mode Favorite",
    "riddle": "I'm an appearance setting that makes your screen darker. I save battery and help your eyes at night. What mode am I?",
    "answer": "Dark mode / Night mode"
  },
  {
    "id": 17,
    "clue": "The Viral Spread",
    "riddle": "When content spreads rapidly online, it's said to go _____. It's named after something that makes you sick. What word am I?",
    "answer": "Viral"
  },
  {
    "id": 18,
    "clue": "The Short Message",
    "riddle": "I'm limited to 280 characters (used to be 140). I have hashtags and retweets. My logo is a blue bird. What am I?",
    "answer": "Tweet / Twitter / X"
  },
  {
    "id": 19,
    "clue": "The Copy Paste Helper",
    "riddle": "I temporarily store what you copy. I hold your text or images until you paste them somewhere else. What am I?",
    "answer": "Clipboard"
  },
  {
    "id": 20,
    "clue": "The Refresh Button",
    "riddle": "When a webpage isn't loading right, you press me. I make things load again from the start. I'm often an arrow in a circle. What am I?",
    "answer": "Refresh / Reload button"
  }
]